In [1]:
import  pandas as pd
import sqlalchemy

In [10]:
engine=sqlalchemy.create_engine('mysql+pymysql://root:password#$@localhost:3306/blancodb')

In [11]:
df=pd.read_sql_table("customers",engine)

In [12]:
df

   customer_id    name phone_number
0            1    Anis   9847844911
1            2   Hamal   9812840326
2            3  Blanco   9857821252

In [18]:
df1=pd.read_sql_table("orders",engine, columns=["name","amount"])

In [19]:
df1

           name amount
0   mobilephone  37000
1  Mac Book Pro  37000

In [20]:
query='''SELECT customers.name, customers.phone_number, orders.name, orders.amount
FROM customers INNER JOIN orders
ON customers.customer_id=orders.customer_id
'''
dfs=pd.read_sql_query(query,engine)
dfs

    name phone_number          name amount
0   Anis   9847844911   mobilephone  37000
1  Hamal   9812840326  Mac Book Pro  37000

In [22]:
dfwd=pd.read_csv('weather_data.csv')

In [23]:
dfwd

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [25]:
engine=sqlalchemy.create_engine('mysql+pymysql://root:password@#$@localhost:3306/blancodb')

In [27]:
dfwd.to_sql(
    name='weather',
    con=engine,
    index=False,
    if_exists='append'
)

In [28]:
pd.read_sql('weather',engine)

        day temperature windspeed  event
0  1/1/2017          32         6   Rain
1  1/2/2017          35         7  Sunny
2  1/3/2017          28         2   Snow
3  1/4/2017          24         7   Snow
4  1/5/2017          32         4   Rain
5  1/6/2017          31         2  Sunny

In [36]:
query=''' SELECT windspeed 
FROM weather
WHERE temperature=32
'''
pd.read_sql(query,engine)

  windspeed
0         6
1         4

This is all about working with reading writing data from and to the SQL databases.